app/controllers/pins_controller.rb

  def pinsof
    @user_id = params[:user_id]
    @user = User.find(@user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @pin = Pin.new(pin_params)
    #@pins = current_user.pins
    @pin.user_id = current_user.id


    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("photo", "description", "created_at", "updated_at", "name", "user_id") VALUES (?, ?, ?, ?, ?, ?)